heartnheart.org
* PreSetup
** load path
Other manually download files are stored in directory other-els
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/other-els")
#+END_SRC
** OS variables
set up variables indicating current OS environment
#+BEGIN_SRC emacs-lisp
  (setq heartnheart/is-win32 (eq system-type 'windows-nt))
  (setq heartnheart/is-cygwin (eq system-type 'cygwin))
  (setq heartnheart/is-linux (or (eq system-type 'gnu/linux) (eq system-type 'linux)))
#+END_SRC
   
** setup ELPA
#+BEGIN_SRC emacs-lisp
  (setq package-archives
        '(("gnu"         . "http://elpa.gnu.org/packages/")
          ("original"    . "http://tromey.com/elpa/")
          ("org"         . "http://orgmode.org/elpa/")
          ("marmalade"   . "http://marmalade-repo.org/packages/")
          ("melpa" . "http://melpa.milkbox.net/packages/")))
  (package-initialize)
  
  ;;------------------------------------------------------------------------------
  ;; On-demand installation of packages -- from binchen
  ;;------------------------------------------------------------------------------
  
  (defun require-package (package &optional min-version no-refresh)
    "Ask elpa to install given PACKAGE."
    (if (package-installed-p package min-version)
        t
      (if (or (assoc package package-archive-contents) no-refresh)
          (package-install package)
        (progn
          (package-refresh-contents)
          (require-package package min-version t)))))
#+END_SRC

#+RESULTS:
: require-package

   


   
* Feature Setup
** no splash screen
#+BEGIN_SRC emacs-lisp
  (setq inhibit-splash-screen  t)
#+END_SRC
** emacs等宽字体设置
The best way to align org table containing Unicode character is to use
 a monospaced unicode font.
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(font . "YtYaHei:pixelsize=20"))
#+end_src

** 设置emacs默认浏览器
#+begin_src emacs-lisp
  (setq browse-url-generic-program (executable-find "firefox")
        browse-url-browser-function 'browse-url-generic)
#+end_src
** 鼠标滚轮修改字体大小
#+BEGIN_SRC emacs-lisp
  (if heartnheart/is-win32
      (progn 
              (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
              (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease))
    (progn
      (global-set-key (kbd "<C-mouse-4>") 'text-scale-increase)
      (global-set-key (kbd "<C-mouse-5>") 'text-scale-decrease)))
#+END_SRC
** 修改设置Mark的绑定
#+begin_src emacs-lisp
  ;; change S-SPC to set mark
  (global-set-key [?\S- ] 'set-mark-command)
#+end_src
** 修改M-W和C-W的行为
当选中区域的时候，它们表现为默认行为。否则对当前行操作。
#+begin_src emacs-lisp
  ;; set new method of kill a whole line 
  (defadvice kill-ring-save (before slickcopy activate compile)
    "When called interactively with no active region, copy a single line instead."
    (interactive
     (if mark-active (list (region-beginning) (region-end))
       (list (line-beginning-position)
             (line-beginning-position 2)))))
  
  (defadvice kill-region (before slickcut activate compile)
    "When called interactively with no active region, kill a single line instead."
    (interactive
     (if mark-active (list (region-beginning) (region-end))
       (list (line-beginning-position)
             (line-beginning-position 2)))))
  
#+end_src
** 设置启动时窗口的大小
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(width . 80))
  (add-to-list 'default-frame-alist '(height . 25))
#+END_SRC
** replace selected text when typing
#+BEGIN_SRC emacs-lisp
  (delete-selection-mode 1)
#+END_SRC
** auto-mode-alist
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
#+END_SRC

** coding system for EN system
#+BEGIN_SRC emacs-lisp
  (setq-default buffer-file-coding-system 'utf-8)
#+END_SRC
* Packages Setup (BuiltIn)
** flyspell 
   #+begin_src emacs-lisp
     ;; use apsell as ispell backend
     (setq-default ispell-program-name "aspell")
     ;; use American English as ispell default dictionary
     (ispell-change-dictionary "american" t)
     (eval-after-load "flyspell"
       '(define-key flyspell-mode-map (kbd "C-M-i") nil))
     
   #+end_src
** flymake
#+BEGIN_SRC emacs-lisp
  (require 'flymake-cursor)
#+END_SRC
** spell check
   #+BEGIN_SRC emacs-lisp
     
     (setq ispell-program-name
           (cond (heartnheart/is-win32 "D:/Software/cygwin/bin/aspell")
                 (t "aspell")
                 ))
     (setq ispell-personal-dictionary "~/.ispell")
     (require 'ispell)
     (global-set-key (kbd "<f8>") 'ispell-word)
   #+END_SRC
     
** ERC
#+BEGIN_SRC emacs-lisp
(require 'erc)


#+END_SRC

** shell mode

** gnus
#+BEGIN_SRC emacs-lisp
  (defun my-gnus-group-list-subscribed-groups ()
    "List all subscribed groups with or without un-read messages"
    (interactive)
    (gnus-group-list-all-groups 5)
    )
   (add-hook 'gnus-group-mode-hook
             ;; list all the subscribed groups even they contain zero un-read messages
             (lambda () (local-set-key "o" 'my-gnus-group-list-subscribed-groups ))
             )
#+END_SRC
* Packages Setup (ELPA)
  
** zenburn theme
  #+begin_src emacs-lisp
    (require-package 'zenburn-theme)
    (load-theme 'zenburn t)
  #+end_src
** autopair
   #+begin_src emacs-lisp
     (require-package 'autopair)
     (require 'autopair)
     (autopair-global-mode)
   #+end_src
** smex
   #+begin_src emacs-lisp
     (require-package 'smex)
     (require 'smex)
     (smex-initialize)
     (global-set-key (kbd "M-x") 'smex)
     (global-set-key (kbd "M-X") 'semx-major-mode-commands)
     ;; To use the old M-x
     (global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
   #+end_src
** switch-window
   #+BEGIN_SRC emacs-lisp
     (require-package 'switch-window)
     (require 'switch-window)
   #+END_SRC
  
** ace-jump-mode
   #+BEGIN_SRC emacs-lisp
     (require-package 'ace-jump-mode)
     (require 'ace-jump-mode)
     (global-set-key (kbd "C-c j") 'ace-jump-mode)
   #+END_SRC
** org2blog
*** advice for org2blog-post
    #+BEGIN_SRC emacs-lisp :tangle no
      (defadvice org2blog/wp-post-buffer
       	(around crystal/wp-post-buffer-around activate)
       	"save flyspell state before post and restore it"
       	(let ((flyspell-state (and (boundp 'flyspell-mode) flyspell-mode)))
              (progn 
               	ad-do-it
               	(and flyspell-state (flyspell-mode 1)))))
    #+END_SRC
*** org2blog
    #+begin_src emacs-lisp :tangle no
      ;(add-to-list 'load-path "D:/home/.emacs.d/fromgit/org2blog")
      ;(require 'org2blog-autoloads)
      (setq org2blog/wp-blog-alist
	    '(("heartnheart"
	       :url "http://www.heartnheart.org/xmlrpc.php"
	       :username "speculation437"
	       :tags-as-categories nil)))
    #+end_src


** auto-complete
*** auto-complete pcomplete
#+BEGIN_SRC emacs-lisp

#+END_SRC
*** Common settup
   #+BEGIN_SRC emacs-lisp
     (require-package 'auto-complete)
     (require 'auto-complete-config)
     (ac-config-default)
     (setq ac-use-menu-map t)
     (define-key ac-menu-map "\C-n" 'ac-next)
     (define-key ac-menu-map "\C-p" 'ac-previous)
     (setq ac-auto-start nil)
     (setq ac-delay 0.5)
     (require 'ac-math)
     
     (add-to-list 'ac-modes 'org-mode)   ; make auto-complete aware of `org-mode`
     
     
     (defun ac-org-mode-setup ()         ; add ac-sources to default ac-sources
       (setq ac-sources
          (append '(ac-source-math-unicode ac-source-math-latex ac-source-latex-commands )
                    ac-sources)))
     
     
     
     (add-hook 'org-mode-hook 'ac-org-mode-setup)
     
     ;; (require 'auto-complete-clang-async)
     
     ;; (defun ac-cc-mode-setup ()
     ;;   (setq ac-clang-complete-executable "/usr/local/bin/clang-complete")
     ;;   (setq ac-sources '(ac-source-clang-async))
     ;;   (ac-clang-launch-completion-process)
     ;; )
     
     ;; (defun my-ac-config ()
     ;;   (add-hook 'c-mode-common-hook 'ac-cc-mode-setup)
     ;;   (add-hook 'auto-complete-mode-hook 'ac-common-setup)
     ;;   (global-auto-complete-mode t))
     
     ;; (my-ac-config)
   #+END_SRC

** company-mode
   #+BEGIN_SRC emacs-lisp :tangle no
     (require-package 'company)
     (add-hook 'after-init-hook 'global-company-mode)
     (eval-after-load 'company
                        '(add-to-list 'company-backends 'company-cmake))
     (global-set-key (kbd "M-?") 'company-complete)
     
   #+END_SRC
** yasnippet
   #+BEGIN_SRC emacs-lisp
     (require-package 'yasnippet)
     (yas-global-mode 1)
   #+END_SRC
** smart-compile
   #+BEGIN_SRC emacs-lisp :tangle no
     ;; (require-package 'smart-compile)
     ;; (require 'smart-compile)
     ;; (global-set-key (kbd "<f9>") 'smart-compile)
   #+END_SRC
** cmake mode
   #+BEGIN_SRC emacs-lisp
     (require-package 'cmake-mode)
     (require 'cmake-mode)
     (setq auto-mode-alist
           (append '(("CMakeLists\\.txt\\'" . cmake-mode)
                     ("\\.cmake\\'" . cmake-mode))
                   auto-mode-alist))
   #+END_SRC
** cpputils-cmake
   #+BEGIN_SRC emacs-lisp 
     (require-package 'cpputils-cmake)
     (add-hook 'c-mode-hook (lambda () (cppcm-reload-all)))
     (add-hook 'c++-mode-hook (lambda () (cppcm-reload-all)))
     (message "CHANGED C++ MODE hook here!")
     ;; OPTIONAL, somebody reported that they can use this package with Fortran
     (add-hook 'c90-mode-hook (lambda () (cppcm-reload-all)))
     
     ;; ;; OPTIONAL, avoid typing full path when starting gdb
     ;; (global-set-key (kbd "C-c C-g")
     ;;  '(lambda ()(interactive) (gud-gdb (concat "gdb --annotate=3 --fullname " (cppcm-get-exe-path-current-buffer))))
     ;; )
   #+END_SRC

** wxwidgets-help
   #+BEGIN_SRC emacs-lisp
     (require-package 'wxwidgets-help)
     (global-set-key (kbd "C-c w")
                     '(lambda ()
                        (interactive)
                        (wxhelp-browse-class-or-api (thing-at-point 'symbol))))
   #+END_SRC

