heartnheart.el

(add-to-list 'load-path "~/.emacs.d/other-els")

(setq heartnheart/is-win32 (eq system-type 'windows-nt))
(setq heartnheart/is-cygwin (eq system-type 'cygwin))
(setq heartnheart/is-linux (or (eq system-type 'gnu/linux) (eq system-type 'linux)))

(setq package-archives
      '(("gnu"         . "http://elpa.gnu.org/packages/")
        ("original"    . "http://tromey.com/elpa/")
        ("org"         . "http://orgmode.org/elpa/")
        ("marmalade"   . "http://marmalade-repo.org/packages/")
        ("melpa" . "http://melpa.milkbox.net/packages/")))
(package-initialize)

;;------------------------------------------------------------------------------
;; On-demand installation of packages -- from binchen
;;------------------------------------------------------------------------------

(defun require-package (package &optional min-version no-refresh)
  "Ask elpa to install given PACKAGE."
  (if (package-installed-p package min-version)
      t
    (if (or (assoc package package-archive-contents) no-refresh)
        (package-install package)
      (progn
        (package-refresh-contents)
        (require-package package min-version t)))))

(setq inhibit-splash-screen  t)

(add-to-list 'default-frame-alist '(font . "YtYaHei:pixelsize=20"))

(setq browse-url-generic-program (executable-find "firefox")
      browse-url-browser-function 'browse-url-generic)

(if heartnheart/is-win32
    (progn 
            (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
            (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease))
  (progn
    (global-set-key (kbd "<C-mouse-4>") 'text-scale-increase)
    (global-set-key (kbd "<C-mouse-5>") 'text-scale-decrease)))

;; change S-SPC to set mark
(global-set-key [?\S- ] 'set-mark-command)

;; set new method of kill a whole line 
(defadvice kill-ring-save (before slickcopy activate compile)
  "When called interactively with no active region, copy a single line instead."
  (interactive
   (if mark-active (list (region-beginning) (region-end))
     (list (line-beginning-position)
           (line-beginning-position 2)))))

(defadvice kill-region (before slickcut activate compile)
  "When called interactively with no active region, kill a single line instead."
  (interactive
   (if mark-active (list (region-beginning) (region-end))
     (list (line-beginning-position)
           (line-beginning-position 2)))))

(add-to-list 'default-frame-alist '(width . 80))
(add-to-list 'default-frame-alist '(height . 25))

(delete-selection-mode 1)

(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))

(setq-default buffer-file-coding-system 'utf-8)

;; use apsell as ispell backend
(setq-default ispell-program-name "aspell")
;; use American English as ispell default dictionary
(ispell-change-dictionary "american" t)
(eval-after-load "flyspell"
  '(define-key flyspell-mode-map (kbd "C-M-i") nil))

(require 'flymake-cursor)

(setq ispell-program-name
      (cond (heartnheart/is-win32 "D:/Software/cygwin/bin/aspell")
            (t "aspell")
            ))
(setq ispell-personal-dictionary "~/.ispell")
(require 'ispell)
(global-set-key (kbd "<f8>") 'ispell-word)

(require 'erc)

(defun my-gnus-group-list-subscribed-groups ()
  "List all subscribed groups with or without un-read messages"
  (interactive)
  (gnus-group-list-all-groups 5)
  )
 (add-hook 'gnus-group-mode-hook
           ;; list all the subscribed groups even they contain zero un-read messages
           (lambda () (local-set-key "o" 'my-gnus-group-list-subscribed-groups ))
           )

(require-package 'zenburn-theme)
(load-theme 'zenburn t)

(require-package 'autopair)
(require 'autopair)
(autopair-global-mode)

(require-package 'smex)
(require 'smex)
(smex-initialize)
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'semx-major-mode-commands)
;; To use the old M-x
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)

(require-package 'switch-window)
(require 'switch-window)

(require-package 'ace-jump-mode)
(require 'ace-jump-mode)
(global-set-key (kbd "C-c j") 'ace-jump-mode)



(require-package 'auto-complete)
(require 'auto-complete-config)
(ac-config-default)
(setq ac-use-menu-map t)
(define-key ac-menu-map "\C-n" 'ac-next)
(define-key ac-menu-map "\C-p" 'ac-previous)
(setq ac-auto-start nil)
(setq ac-delay 0.5)
(require 'ac-math)

(add-to-list 'ac-modes 'org-mode)   ; make auto-complete aware of `org-mode`


(defun ac-org-mode-setup ()         ; add ac-sources to default ac-sources
  (setq ac-sources
     (append '(ac-source-math-unicode ac-source-math-latex ac-source-latex-commands )
               ac-sources)))



(add-hook 'org-mode-hook 'ac-org-mode-setup)

;; (require 'auto-complete-clang-async)

;; (defun ac-cc-mode-setup ()
;;   (setq ac-clang-complete-executable "/usr/local/bin/clang-complete")
;;   (setq ac-sources '(ac-source-clang-async))
;;   (ac-clang-launch-completion-process)
;; )

;; (defun my-ac-config ()
;;   (add-hook 'c-mode-common-hook 'ac-cc-mode-setup)
;;   (add-hook 'auto-complete-mode-hook 'ac-common-setup)
;;   (global-auto-complete-mode t))

;; (my-ac-config)

(require-package 'yasnippet)
(yas-global-mode 1)

(require-package 'cmake-mode)
(require 'cmake-mode)
(setq auto-mode-alist
      (append '(("CMakeLists\\.txt\\'" . cmake-mode)
                ("\\.cmake\\'" . cmake-mode))
              auto-mode-alist))

(require-package 'cpputils-cmake)
(add-hook 'c-mode-hook (lambda () (cppcm-reload-all)))
(add-hook 'c++-mode-hook (lambda () (cppcm-reload-all)))
(message "CHANGED C++ MODE hook here!")
;; OPTIONAL, somebody reported that they can use this package with Fortran
(add-hook 'c90-mode-hook (lambda () (cppcm-reload-all)))

;; ;; OPTIONAL, avoid typing full path when starting gdb
;; (global-set-key (kbd "C-c C-g")
;;  '(lambda ()(interactive) (gud-gdb (concat "gdb --annotate=3 --fullname " (cppcm-get-exe-path-current-buffer))))
;; )

(require-package 'wxwidgets-help)
(global-set-key (kbd "C-c w")
                '(lambda ()
                   (interactive)
                   (wxhelp-browse-class-or-api (thing-at-point 'symbol))))
