heartnheart.el

(setq TeX-engine 'xetex)

(defun yodao-dict-search-wordap (&optional word)
  "Use python script dict to look up word under point"
  (interactive)
  (or word (setq word (current-word)))
  ;; for python 27
  (if heartnheart/is-win32
      (shell-command (format (concat "python " (expand-file-name "~/.emacs.d/extra-bin/dict.py") " %s") word))
    ))
(global-set-key [f5] 'yodao-dict-search-wordap)



(defun delete-this-file-to-trash ()
   "Delete (move to trash) the file that is associated with the
  current buffer."
    (interactive)
    (let ((filename (buffer-file-name)))
      (move-file-to-trash filename t)
      (kill-buffer)))

(require 'cc-mode)
(add-to-list 'c++-font-lock-extra-types
             "\\bwx[A-Z][a-z][a-zA-Z]*?\\b")
(defun c-wx-line-up-topmost-intro-cont (langelem)
  (save-excursion
    (beginning-of-line)
    (if (re-search-forward "EVT_" (line-end-position) t)
        'c-basic-offset
      (c-lineup-topmost-intro-cont langelem))))

(add-hook  'c++-mode-hook
           (lambda()
             (c-set-offset 'topmost-intro-cont 'c-wx-line-up-topmost-intro-cont)))

;; (defun ac-complete-semantic-self-insert (arg)
;;   (interactive "p")
;;   (self-insert-command arg)
;;   (ac-complete-semantic))
;; (defun ac-complete-clang-self-insert(arg)
;;   (interactive "p")
;;   (self-insert-command arg)
;;   (ac-complete-clang))
;; (add-hook 'c++-mode-hook
;;           '(lambda ()
;;              (c-set-style "K&R")
;;              (setq tab-width 4)
;;              (setq indent-tabs-mode t)
;;              (setq c-basic-offset 4)
;;              (c-toggle-hungry-state 1)
;;         ;             (flyspell-prog-mode)       ;may conflict with auto-complete-mode
;;              (local-set-key (kbd "RET") 'newline-and-indent)
;;         ;                  (semantic-mode 1)
;;              (local-set-key "." 'ac-complete-clang-self-insert)
;;              (local-set-key ">" 'ac-complete-clang-self-insert)
;;              (local-set-key (kbd "C-c o") 'ff-find-other-file)
;;              ))
;; (require 'auto-complete-clang)
;; (setq ac-quick-help-delay 0.5)
;; (define-key ac-mode-map (kbd "M-/") 'auto-complete)

(global-set-key "%" 'match-paren)
(defun match-paren (arg)
  "Go to the matching paren if on a paren; otherwise insert %."
  (interactive "p")
  (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
        ((looking-at "\\s\)") (forward-char 1) (backward-list 1))
        (t (self-insert-command (or arg 1)))))

;; ;;(setq ac-clang-executable "~/.emacs.d/extra-bin/clang/clang.exe")
(require-package 'auto-complete-clang)
(require 'auto-complete-clang)
;; ;; 添加c-mode和c++-mode的hook，开启auto-complete的clang扩展  
 (defun wttr/ac-cc-mode-setup ()  
   (setq ac-sources (append '(ac-source-clang ac-source-yasnippet) ac-sources)))  
(add-hook 'c-mode-hook 'wttr/ac-cc-mode-setup)  
(add-hook 'c++-mode-hook 'wttr/ac-cc-mode-setup)  


;(setq company-clang-arguments  (list
;; (setq ac-clang-flags   (list   
;;                        "-I/usr/lib/gcc/i686-pc-linux-gnu/4.8.1/../../../../include/c++/4.8.1"
;;                        "-I/usr/lib/gcc/i686-pc-linux-gnu/4.8.1/../../../../include/c++/4.8.1/i686-pc-linux-gnu"
;;                        "-I/usr/lib/gcc/i686-pc-linux-gnu/4.8.1/../../../../include/c++/4.8.1/backward"
;;                        "-I/usr/lib/gcc/i686-pc-linux-gnu/4.8.1/include"
;;                        "-I/usr/local/include"
;;                        "-I/usr/lib/gcc/i686-pc-linux-gnu/4.8.1/include-fixed"
;;                        "-I/usr/include"
;;                        "-I/usr/lib/wx/include/gtk2-unicode-2.9"
;;                        "-I/usr/include/wx-2.9"
;;                        "-D_FILE_OFFSET_BITS=64"
;;                        "-DWXUSINGDLL"
;;                        "-D__WXGTK__"
;;                       ))


(defadvice cppcm-reload-all (after append-stl-flags activate compile)
  (progn
    (setq command "echo | g++ -v -x c++ -E - 2>&1 |
                 grep -A 20 starts | grep include | grep -v search")
    (setq ac-clang-flags
          (append 
           (mapcar (lambda (item)
                     (concat "-I" item))
                   (split-string
                    (shell-command-to-string command)))
           ac-clang-flags)
          )
    ))
