heartnheart.org
** org mode 8 
   #+BEGIN_SRC emacs-lisp
     ;; set org-mode as the default mode for .org, .org_archive, and .txt
     (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)\\'" . org-mode))
     (require 'org)
     
     ;; common key bindings
     (global-set-key "\C-cl" 'org-store-link)
     (global-set-key "\C-cb" 'org-iswitchb)
     (global-set-key "\C-cc" 'org-capture)
     (global-set-key "\C-ca" 'org-agenda)
     
     
     ;; Set todo keywords
     (setq org-todo-keywords
           (quote ((sequence "TODO(t)" "NEXT(n)" "SCHEDULED(s)" "Someday" "|" "DONE(d)")
                   (sequence "WAITING(w@/!)" "HOLD(h@/!)"  "|" "CANCELLED(c@/!)"))))
     
     
     ;; cycle through the TODO states while skipping all the normal process
     (setq org-treat-S-cursor-todo-selection-as-state-change nil)
     
     ;; ORG-CAPTURE
     ;; set the default file for org capture for templates that do not
     ;; specify a target
     (setq org-default-notes-file "~/org/refile.org")
     
     ;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
     (setq org-capture-templates
           (quote (("t" "Todo" entry (file "~/org/refile.org")
                    "* TODO %?\n%U\n%a\n")
                   ("n" "note" entry (file "~/org/refile.org")
                    "* %? :NOTE:\n%U\n%a\n")
                   ("j" "Journal" entry (file+datetree "~/org/journal.org")
                    "* %?\n%U\n" )
                   ("p" "English plural words" table-line (file+headline "~/org/notes.org" "special plural words")
                    "|%?| |%U|")
                                  ("w" "English Words" table-line (file+headline "~/org/refile.org" "new words")
                    "|%?| | | |%U|"               )
     
                   ("e" "Exercise" table-line (file+headline "~/org/exercise.org" "Exercise")
                    "|%?| |  |%U|")
                   )))
     
     
     
     
     
     (setq org-startup-indented t)           ;use org-indent-mode by default
     (setq org-export-with-smart-quotes t)
     ;; use sumatraPDF to open PDF
     (add-hook 'org-mode-hook
           '(lambda ()
              (local-unset-key "\C-c[")
              (local-unset-key "\C-c]")
              (delete '("\\.pdf\\'" . default) org-file-apps)
              (add-to-list 'org-file-apps
                           `("\\.pdf\\'" .
                             ,(cond (heartnheart/is-win32 "sumatraPDF -reuse-instance %s")
                                   (t "FoxitReader %s")
                                   )
                             )
                           )))
     
     
     
     ;; agenda
     (setq org-agenda-files '("~/org/refile.org" 
                              "~/org/task.org"
                              "~/org/notes.org"
                              "~/research/notes/ResearchNotes.org"
                              ;; for current classes
                              "~/classes/PR/notes/PR.org"
                              "~/classes/grsc6001/notes/grsc6001.org"
                              "~/classes/grsc6008/notes/grsc6008.org"
                              ))
     
     ;; refile
     (setq org-refile-use-outline-path 'file)
     (setq org-refile-targets '((org-agenda-files . (:maxlevel .  4)))) ;ATTEDTION! must set after
                                             ;org-ageda-files has been set
   #+END_SRC

** org drill
The Easiest way is to tick `org-drill' using customize of variable
`org-modules'. For manually set up, use `(require 'org-drill)'

** org mobile
#+BEGIN_SRC emacs-lisp
  (setq org-mobile-directory "~/org/MobileOrg")
  (setq org-mobile-checksum-binary (cond
                                    (heartnheart/is-win32 "D:/home/.emacs.d/extra-bin/sha1sum.exe")
                                    (t "shasum")))
                               
  
  (setq org-mobile-inbox-for-pull "~/org/refile.org")
  
  
#+END_SRC

** reftex
#+BEGIN_SRC emacs-lisp
  (setq reftex-default-bibliography '("~/research/references/references.bib"))
  (setq reftex-cite-format "\\citeA{%l}" )
#+END_SRC
** org latex pdf
#+BEGIN_SRC emacs-lisp
  (setq org-latex-pdf-process '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "bibtex %b"
                                "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  
                                          ;(setq org-latex-pdf-process (list "latexmk -pdf -bibtex %f"))
  (require 'ox-latex)
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)
#+END_SRC
** org beamer
